[
	{
		"headline": "Thirty Seconds To Mars - America",
		"author": "Simon.K",
		"item_class": "music review",
		"guid": "f21f6d26-aaaa-1111-8401-ed4dfe8ebc2c",
		"pub_date": "Wed, 10 Apr 2018 09:25:00 EDT",
		"summary": "Matthew 5: Now when Jared saw the crowds, he went up on a mountainside and sat down. His disciples came to him, and he began to sell them America.",
		"full_text": "<p>Once upon a time, Thirty Seconds to Mars showed real potential. No, really, they did. Even by taking Jared Leto's well-established acting profile away from the scenario and looking at the band off of their own merits, there was a scintillating future lined up for them. All they had to do was stick to their guns. An ebullition of excitement, on the cusp of greatness, and then the last ten years happened… The optimist in me tried to reject what had happened here, it's through this which helped me find one redeeming quality from it all; an interesting little tale which is far more interesting than anything they've put out in the last few years.</p><p>You see, back in 2002 Jared and Shannon set out on this successful journey as a dingy, experimental alt-rock outfit. That's right, folks. The 2002 self-titled debut was a bulkhead of Nirvana-inspired melodies and simply constructed songs thrown into the confinements of a raw energy, galvanized with a brace of effects to deliver on the band's concept: Space. You can listen to Jared explain what the name represents these days, but it's a load of old pigswill. In the adolescent days of 30STM their shtick was a conceptual focus on space & time; from the name, right down to the very look of the band. Adult themes of sex, human consciousness, religious symbolism, cults and new civilisations in the galactic unknown were the order of the day, and Leto offered it up using a trove of accessible song-writing tools to attain it. The results weren't going to bring the hysterical masses to the door, but it was an album that brought exciting dimensions to an otherwise tired genre.</p><p>It's from here where things get brought up a notch. Their second and third attempts were far less despondent and more welcoming: a glossy production, leaner song-writing and a surprise departure from the unique themes originally being ran with. Even so, despite A Beautiful Lie's malnourishment in alluring, ambiguous qualities it made up for it with next-level writing; tracks that would change their career forever. An amalgam of alt-rock and (Leto's truelove) cinema, the LP's aesthetic was radio-rock with a grandiose swagger to it, continuing to showcase talent within the bandcamp in a different way. 2009's This is War was a slightly different story though and was the first misstep in the band's evolution. It took me a long time to appreciate this record for what it was, due in part to an over-saturation of fan-chanting which damaged potentially solid tracks and a heavier emphasis on pompous ideas. Still, in its defiance of ruining what was going so well previous, there was a lot of really amazing pieces to unearth. It's reliance on the pop mindset was absolute, but it continued to show a complex to the band.</p><p>So, after surviving a hellish lawsuit with EMI – which served as creative fuel and theme for This is War – which endured for a life-reducing year, they not only came out victorious from the battle but achieved dominating success with their latest offering, resulting in a band on top of the world. Where do you go from here？ You make another album, and, oh boy, did it go wrong. Imagine a record with all the worst aspects from previous efforts rolled up into one cynically hollow construct and you'll get an idea of what Love, Lust, Faith + Dreams is all about. More pretentious, watered down and vapid, it offered a couple of decent ideas but on the whole was a near write-off. It was a complete shutdown on their roots; a disregard of what their original intentions were. This wasn't an album to push the band or the artform, it was an exercise in narcissistic futility and how much bigger they could get.</p><p>After the trite offerings of 2013, if you were praying for something with a little more weight this time you're going to be in for a disappointment. Unsurprisingly, America feels more tired and weak than its predecessor. Throughout the band's career religious symbolism has been a focal point; innocently placed with actual context on their debut album before morphing into its own entity after every album cycle. It's appearance here is nauseatingly present, just from looking at their most recent insignia of a cross and the band's iconic triangle melded together, it looks as though they're trying to start their own Scientology experiment with fans. The constant reminder given to kids that they're apart of a \"cult\" makes for a worrying prospect as a longhaired, beard-sporting Leto stands above his cultists with the mannerisms of being a sort of reincarnation of Christ. The band name no longer represents space, time and exploration – that sh*t is too boring to sell to kids these days. No, 30STM is a brand name used to shift units and offer deep, meaningful slogans like: \"Yes, this is a cult\", which you can buy for $60 on a sweater. But I digress, this is a topic of discussion reserved for another day.</p><p>Where was I？ – The songs, that's right. The regression of everyone's talent is in startlingly full effect here. Leto's continuing trend of vocal work at a lazy minimum is ever present, as he bombards songs with his irritating by-the-numbers \"oh-wa-oh\" chants and lifeless raspy whispers than giving us a solid and able melody, – something he is more than capable of doing – which is then perfectly topped off with the perpetual support of his backing chanters. \"Live Like A Dream\" \"Walk on Water\", \"Great Wide Open\" and \"Dangerous Night\" all contain the insipid vocal traits I've come to loath in recent years, as well as an abundance of skeletal instrumentation and awkward transitions. Shannon's drums continue to slope off into the backburner while simple and weak electronic-percussive booms sit at the front of house. Tomo's presence as a guitar player is now virtually non-existent, he is now allotted the position of key-master, delivering painfully banal compositions on a synth to accommodate Jared's dreary one-dimensional contributions; the kind of writing you know will get everyone worked up when they see the band live: a silly repetitive chant or hook is the primary focus these days and oh, do they use it to the fullest here. The eye-rolling and pompous French spoken word intro to \"Dawn Will Rise\", with its laughably out of place auto-tune and desperate search for atmosphere and mood can't mask this musically anaemic waste of time; \"Hail to the Victor\" with its club-building crescendo quickly sets off alarms as you're hit with a textbook wall of sub-bass and high frequency electronics; and \"Live Like A Dream\" for its completely trite and exhausted sound at this point.</p><p>It leaves me distraught thinking about the direction they've gone in. This is War wasn't a perfect album by any means, but it had some genuinely interesting ideas nestled underneath it all. It balanced the pop formula with the rock, electronic and experimental parts perfectly, and even with a few hitches still came out with solid songs. I mean, if I'm extending my hand in search of any positives here, in spite of Halsey's horrendous contributions of modern pop tropes and nasally croons that ruin the bulk of \"Love Is Madness\", the electronic build-up in the mid-section of the track is a melancholic highlight; while \"Remedy\" easily shows as the best track here: a simple and refreshing acoustic piece that has a nice smooth melody and rhythmic bounce. However, the quality on here is fundamentally insulting, and even with the odd moment being pulled from the odd song this is an alarming misfire for the band. Shannon is a beast on the kit; Jared has a brilliant voice; and Tommo has shown his worth as a solid and able guitar player, but none of that is present here. It's all been flushed down the toilet for the shallow pseudo cinematics pertained on 2013's weak attempt, with an even higher reliance on the cynical radio formula to expand on their cultist numbers. I think the biggest sore for Thirty Seconds to Mars comes from the feeling they haven't made an album with real or genuine emotion since This is War. The band just seems to be hellbent on composing disposable garbage, implementing cheap methods of writing to their songs in the hope it'll draw in more fans and indeed, more money.</p><p>The obvious part at this point is I don't recommend this album, but the sad truth is, it probably won't stop \"The Cult\" from getting any bigger. With so little effort being made on their end, the decent thing to do would be to let this thing go unsupported and have them realise they need to come back next time with hunger in their bellies and more admirable intentions on why they're still doing this. One of latter day 30STM's biggest strengths was being able to create a really moody and enticing slow track; they knew how to draw you in with their dejected electronics and thick atmosphere. Here, even a track like \"One Track Mind\" can only do the job half as well; ticking every contemporary pop and pop-rap cliché in the book on top of what could have been a pretty interesting piece. Instead the song is drowning in auto-tune and cheap metronome high-hat taps, with a pretty cringe guest spot from A$AP Rocky to add insult to injury. The best description I can give on what this sounds like is imagine Love, Lust, Faith + Dreams, half the interesting ideas from that and besiege any potential enjoyment with derivative electronic pre-set effects and sounds, with an immense reliance on auto-tune – something that really damages a lot of the work here, as it fuses with Jared's voice throughout the duration with little reason on why it's there other than to appeal to current trends. I see possibility in a song like \"Rescue Me\" with its rubbery bassline, simple chord sequence and vocals that show as one of the lesser lazy performances here, but these moments are a needle in a haystack and feel underdeveloped at best anyways; and even with a more positive note being made for the track, it's still weighed down by problems the album is inherently plagued with. I can't put enough emphasis on just how forced and obvious the marketability is for this; like they entered a load of formulas into a computer to see what would result in optimum listens and out came a song like \"Walk on Water\". I once saw a bright future for the Leto brothers and Tomo, now all I see is badly lit fascist rallies, brainwashed teenagers and an increasingly delusional frontman.</p>",
		"lead_image": "http://www.rtodd.net/swift/images/events/music-reviews/america.jpg",
		"images": [
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/thirty-seconds-to-mars01.jpg",
				"title": "Thirty Seconds To Mars",
				"caption": "Now when Jared saw the crowds, he went up on a mountainside and sat down. His disciples came to him, and he began to sell them America.",
				"credit": "Sputnik Music"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/thirty-seconds-to-mars02.jpg",
				"title": "Thirty Seconds To Mars",
				"caption": "Now when Jared saw the crowds, he went up on a mountainside and sat down. His disciples came to him, and he began to sell them America.",
				"credit": "Sputnik Music"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/thirty-seconds-to-mars03.jpg",
				"title": "Thirty Seconds To Mars",
				"caption": "Now when Jared saw the crowds, he went up on a mountainside and sat down. His disciples came to him, and he began to sell them America.",
				"credit": "Sputnik Music"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/thirty-seconds-to-mars04.jpg",
				"title": "Thirty Seconds To Mars",
				"caption": "Now when Jared saw the crowds, he went up on a mountainside and sat down. His disciples came to him, and he began to sell them America.",
				"credit": "Sputnik Music"
			}
		],
		"locations": [
			{
				"latitude": 32.515985,
				"longitude": -93.732123,
				"name": "Bossier City, Louisiana"
			}
		],
		"related_content": [
			{
				"headline": "Ben Barnes - British actor and singer",
				"summary": "In September 2006, Barnes was cast as Prince Caspian in The Chronicles of Narnia films Prince Caspian and The Voyage of the Dawn Treader. He has also played Tom Ward in the fantasy film Seventh Son, Dorian Gray in the 2009 adaptation of Oscar Wilde's The Picture of Dorian Gray, had supporting roles in The Words, and The Big Wedding, and portrayed Samuel Adams in the 2015 miniseries Sons of Liberty.",
				"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/ben-barnes.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Ellen Page - Canadian actress",
				"summary": "In 2008, Page was one of 30 celebrities who participated in an online ad series for US Campaign for Burma, calling for an end to the military dictatorship in Burma. She describes herself as a pro-choice feminist.",
				"pub_date": "Fri, 01 Mar 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/ellen-page.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Nico Tortorella - American actor and model",
				"summary": "Speaking to the New York Post's Page Six in June 2016, Tortorella declared himself to be sexually fluid. He later identified as bisexual in an interview with Vulture on October 30, 2016. In November 2017 he talked about being in a polyamorous relationship, a revelation that has gotten him uninvited from his partner's family's Thanksgiving dinner.",
				"pub_date": "Fri, 06 Mar 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/nico-tortorella.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Gillian Anderson - American-British film, television and theatre actress, activist and writer",
				"summary": "Anderson resides with her three children in London, England, where she has lived since 2002. She has been in a relationship with screenwriter and dramatist Peter Morgan since 2016.",
				"pub_date": "Fri, 016 Mar 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/gillian-anderson.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Andy Mientus - American stage and television actor and singer",
				"summary": "On March 9, 2018 Amulet Books, an imprint of ABRAMS, announced that Mientus has written a middle-grade fiction series called The Backstagers",
				"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/andy-mientus.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Jonathan Groff - American actor and singer",
				"summary": "Groff publicly came out as gay in October 2009 during the National Equality March in Washington.[29] From 2009 to 2010, Groff dated actor Gavin Creel.[30] From 2010 to 2013, Groff was in a relationship with actor Zachary Quinto.",
				"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/jonathan-groff.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			}
		]
	},
	{
		"headline": "Jukebox the Ghost share the Origins of their new single \"Everybody's Lonely\": Stream",
		"author": "Eddie Fuon",
		"item_class": "music review",
		"guid": "f21f6d26-aaaa-1111-8401-ed4dfe8ebc2c",
		"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
		"summary": "Queen-influenced track was inspired by a conversation with vocalist Ben Thornewill's grandmother",
		"full_text": "<p>Piano pop trio Jukebox the Ghost have been around over a decade and played well over 800 shows behind four full-length albums, sharing stages with the likes of Ben Folds, Jack's Mannequin, Motion City Soundtrack, and Ingrid Michaelson. They even captured the infectious energy of their performances with a Kickstarter-funded live album in 2016. The group isn't content to rest on their accomplishments, however, and are primed for a big year they're kicking off with a new single called \"Everybody's Lonely\".</p><p>Their latest track is instantly among the group's finest, featuring a memorable chorus and buoyant melodies influenced by their love for Queen. Meanwhile, the song's lyrics go a bit meta as the band tries to figure out why so many songs - even their own - focus on the same subject matter. \"Why's every song about love,\" vocalist and pianist Ben Thornewill sings. \"Or drinking too much?/ Yeah maybe that's because/ Everybody's lonely.\"</p><p>Update: \"Everybody's Lonely\" is taken from the band's new album, announced today. It's dubbed Off to the Races and due out March 30th via Jukebox the Ghost/Caroline. The LP follows their self-titled record released in 2014 and marks their fifth overall.</p><p>To provide insight into \"Everybody's Lonely\", Thornewill has shared the Origins behind the track - from his grandmother to Queen to Jackson Pollock.</p><p>The idea for \"Everybody's Lonely\" actually came out of a conversation with my grandmother. She grew up in a small town in Minnesota and was a little girl during World War Two. We were talking about the songs she grew up with and she told me that when she was young, she asked her mother why all the songs were about love and her mother answered, \"Because everyone is so lonesome, dear.\" This, of course, was during wartime - all the men (yep) of appropriate age had left and the town was quiet, or rather quiet even for Bayport, Minnesota. We live in a different time now, but the human experience is still the same - most songs on the radio are still about love in some form or another.</p>",
		"lead_image": "http://www.rtodd.net/swift/images/events/music-reviews/everybodys-lonely.jpg",
		"images": [
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/jukebox-the-ghost06.jpg",
				"title": "Jukebox the Ghost",
				"caption": "Jukebox the Ghost share the Origins of their new single",
				"credit": "Music Magazine"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/jukebox-the-ghost01.jpg",
				"title": "Jukebox the Ghost",
				"caption": "Jukebox the Ghost share the Origins of their new single",
				"credit": "Music Magazine"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/jukebox-the-ghost02.jpg",
				"title": "Jukebox the Ghost - Piano pop trio",
				"caption": "Piano pop trio Jukebox the Ghost have been around over a decade",
				"credit": "Spin Magazine"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/jukebox-the-ghost03.jpg",
				"title": "The group isn't content to rest on their accomplishments",
				"caption": "Kickstarter-funded live album in 2016",
				"credit": "Creem Magazine"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/jukebox-the-ghost04.jpg",
				"title": "From his grandmother to Queen to Jackson Pollock",
				"caption": "Influenced by their love for Queen",
				"credit": "Musician Magazine"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/jukebox-the-ghost05.jpg",
				"title": "The human experience is still the same",
				"caption": "The LP follows their self-titled record released in 2014 and marks their fifth overall",
				"credit": "New York Times"
			}
		],
		"locations": [
			{
				"latitude": 38.896769,
				"longitude": -77.017536,
				"name": "DC metro-area"
			}
		],
		"related_content": [
			{
				"headline": "Ben Barnes - British actor and singer",
				"summary": "In September 2006, Barnes was cast as Prince Caspian in The Chronicles of Narnia films Prince Caspian and The Voyage of the Dawn Treader. He has also played Tom Ward in the fantasy film Seventh Son, Dorian Gray in the 2009 adaptation of Oscar Wilde's The Picture of Dorian Gray, had supporting roles in The Words, and The Big Wedding, and portrayed Samuel Adams in the 2015 miniseries Sons of Liberty.",
				"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/ben-barnes.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Ellen Page - Canadian actress",
				"summary": "In 2008, Page was one of 30 celebrities who participated in an online ad series for US Campaign for Burma, calling for an end to the military dictatorship in Burma. She describes herself as a pro-choice feminist.",
				"pub_date": "Fri, 01 Mar 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/ellen-page.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Nico Tortorella - American actor and model",
				"summary": "Speaking to the New York Post's Page Six in June 2016, Tortorella declared himself to be sexually fluid. He later identified as bisexual in an interview with Vulture on October 30, 2016. In November 2017 he talked about being in a polyamorous relationship, a revelation that has gotten him uninvited from his partner's family's Thanksgiving dinner.",
				"pub_date": "Fri, 06 Mar 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/nico-tortorella.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Gillian Anderson - American-British film, television and theatre actress, activist and writer",
				"summary": "Anderson resides with her three children in London, England, where she has lived since 2002. She has been in a relationship with screenwriter and dramatist Peter Morgan since 2016.",
				"pub_date": "Fri, 016 Mar 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/gillian-anderson.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Andy Mientus - American stage and television actor and singer",
				"summary": "On March 9, 2018 Amulet Books, an imprint of ABRAMS, announced that Mientus has written a middle-grade fiction series called The Backstagers",
				"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/andy-mientus.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Jonathan Groff - American actor and singer",
				"summary": "Groff publicly came out as gay in October 2009 during the National Equality March in Washington.[29] From 2009 to 2010, Groff dated actor Gavin Creel.[30] From 2010 to 2013, Groff was in a relationship with actor Zachary Quinto.",
				"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/jonathan-groff.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			}
		]
	},
	{
		"headline": "High Valley Releases \"The Only\" Farmhouse Sessions With Ashley Homestore",
		"author": "Laura Hostelley",
		"item_class": "music review",
		"guid": "f21f6d26-aaaa-1111-8888-ed4dfe8ebc2c",
		"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
		"summary": "High Valley keeps in line with traditional country sounds while they explore Americana, rock and pop influences in their major-label debut album, Dear Life. Tracks of inspiration, desires of the heart and their journey as musicians make up the record. The 11-track project experiments with a variety of beats and guitar picking that keep the music interesting while they share their pitch-perfect harmonies.",
		"full_text": "<p>High Valley keeps in line with traditional country sounds while they explore Americana, rock and pop influences in their major-label debut album, Dear Life. Tracks of inspiration, desires of the heart and their journey as musicians make up the record. The 11-track project experiments with a variety of beats and guitar picking that keep the music interesting while they share their pitch-perfect harmonies.</p><p>Production elements blend genres to create foot-tapping beats and melodies that replay through your head all day. High Valley make their own sound that will stand out on country radio while staying in touch with country roots that serve as each tune's platform.</p><p>The Canadian country group's lead single, \"Make You Mine,\" has the most interesting sound on the album. It sticks out among the rest and will draw intrigued listeners into explore what other stories the duo has to offer.</p><p>\"Dear Life,\" the title track, shares feelings about making choices while growing up. Its message will resonate with much of their audience and may be representative where they are in their own life. It follows similar patterns as surrounding tracks, including heavy drums that bring the song to life.</p><p>\"The Only\" and \"She's With Me\" have comparable themes of adoration. Their obvious pop influences match the song's tone with complimenting faster-tempo beats. The featured repetitive hooks just about guarantee them stuck in your head all day as you fight the urge to dance along.</p><p>Americana influence is heaviest in the No. 8 title, \"I Be U Be.\" The back-and forth nature of the song has hints of tribal elements as strong imagery describes an ideal love scenario. Just as many other included tracks, \"I Be U Be\" stays clear of electric guitar solos and focuses on percussion and diction, a factor that might become a signature in their career.</p><p>The closing track, \"Young Forever\" has a similar vibe that compares to Billy Currington's \"We Are Tonight.\" The embrace-the-moment trend adds a brightness to the album that contributes to its already high-spirited qualities.</p><p>Emotional tracks intertwined with flirty fun songs lead to this diverse album. Dear Life is an exciting piece of art that serves as a solid platform for the bright career they have ahead of them.</p>",
		"lead_image": "http://www.rtodd.net/swift/images/events/music-reviews/farmhouse-sessions.jpg",
		"images": [
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/high-valley05.jpg",
				"title": "Dear Life is an exciting piece of art",
				"caption": "Production elements blend genres to create foot-tapping beats and melodies",
				"credit": "Creem Magazine"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/high-valley01.jpg",
				"title": "While they explore Americana, rock and pop influences",
				"caption": "High Valley keeps in line with traditional country sounds",
				"credit": "Music Magazine"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/high-valley02.jpg",
				"title": "The embrace-the-moment trend adds a brightness to the album",
				"caption": "Tracks of inspiration, desires of the heart",
				"credit": "The Washington Post"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/high-valley03.jpg",
				"title": "Emotional tracks intertwined with flirty fun songs",
				"caption": "The 11-track project experiments with a variety of beats and guitar picking",
				"credit": "Grand Ole Opry"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/high-valley04.jpg",
				"title": "Dear Life is an exciting piece of art",
				"caption": "Production elements blend genres to create foot-tapping beats and melodies",
				"credit": "Creem Magazine"
			}
		],
		"locations": [
			{
				"latitude": 58.187466,
				"longitude": -116.406999,
				"name": "La Crete, Alberta, Canada"
			}
		],
		"related_content": [
			{
				"headline": "Ben Barnes - British actor and singer",
				"summary": "In September 2006, Barnes was cast as Prince Caspian in The Chronicles of Narnia films Prince Caspian and The Voyage of the Dawn Treader. He has also played Tom Ward in the fantasy film Seventh Son, Dorian Gray in the 2009 adaptation of Oscar Wilde's The Picture of Dorian Gray, had supporting roles in The Words, and The Big Wedding, and portrayed Samuel Adams in the 2015 miniseries Sons of Liberty.",
				"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/ben-barnes.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Ellen Page - Canadian actress",
				"summary": "In 2008, Page was one of 30 celebrities who participated in an online ad series for US Campaign for Burma, calling for an end to the military dictatorship in Burma. She describes herself as a pro-choice feminist.",
				"pub_date": "Fri, 01 Mar 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/ellen-page.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Nico Tortorella - American actor and model",
				"summary": "Speaking to the New York Post's Page Six in June 2016, Tortorella declared himself to be sexually fluid. He later identified as bisexual in an interview with Vulture on October 30, 2016. In November 2017 he talked about being in a polyamorous relationship, a revelation that has gotten him uninvited from his partner's family's Thanksgiving dinner.",
				"pub_date": "Fri, 06 Mar 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/nico-tortorella.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Gillian Anderson - American-British film, television and theatre actress, activist and writer",
				"summary": "Anderson resides with her three children in London, England, where she has lived since 2002. She has been in a relationship with screenwriter and dramatist Peter Morgan since 2016.",
				"pub_date": "Fri, 016 Mar 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/gillian-anderson.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Andy Mientus - American stage and television actor and singer",
				"summary": "On March 9, 2018 Amulet Books, an imprint of ABRAMS, announced that Mientus has written a middle-grade fiction series called The Backstagers",
				"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/andy-mientus.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Jonathan Groff - American actor and singer",
				"summary": "Groff publicly came out as gay in October 2009 during the National Equality March in Washington.[29] From 2009 to 2010, Groff dated actor Gavin Creel.[30] From 2010 to 2013, Groff was in a relationship with actor Zachary Quinto.",
				"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/jonathan-groff.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			}
		]
	},
	{
		"headline": "Album of the Week: P!nk Grapples With Having So Much to Lose on Heavy-Hearted 'Beautiful Trauma'",
		"author": "Andrew Unterberger",
		"item_class": "music review",
		"guid": "f21f6d26-aaaa-11e8-8401-ed4dfe8ebc2c",
		"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
		"summary": "P!nk's greatness -- four Hot 100 No. 1 hits, 15 top 10 hits, five multi-platinum-certified albums in six tries -- may have consistently flown below the radar, but she's finally seeing some appreciation for how underappreciated she's been. Following a series of early-decade award-show performances that stunned with their virtuosity and grace, she's developed a reputation as one of pop's premier artists, and her longtime work as a leading music video artist earned her MTV's Michael Jackson Video Vanguard award at this year's VMAs. She's a legit live draw with has a deep catalog of hits she can tour behind forever, and even if her increasingly adult pop/rock doesn't necessarily lie at the heart of streaming, she'll live on pop radio (\"What About Us\" climbed to No. 11 on Radio Songs this week) until she doesn't want it anymore. She's also been married for over a decade, and now has two kids that she's notably attached to. She's never had less to prove, but she's also never had more to lose. And on Beautiful Trauma, she sounds scared shitless by that.",
		"full_text": "<p>P!nk's greatness -- four Hot 100 No. 1 hits, 15 top 10 hits, five multi-platinum-certified albums in six tries -- may have consistently flown below the radar, but she's finally seeing some appreciation for how underappreciated she's been. Following a series of early-decade award-show performances that stunned with their virtuosity and grace, she's developed a reputation as one of pop's premier artists, and her longtime work as a leading music video artist earned her MTV's Michael Jackson Video Vanguard award at this year's VMAs. She's a legit live draw with has a deep catalog of hits she can tour behind forever, and even if her increasingly adult pop/rock doesn't necessarily lie at the heart of streaming, she'll live on pop radio (\"What About Us\" climbed to No. 11 on Radio Songs this week) until she doesn't want it anymore. She's also been married for over a decade, and now has two kids that she's notably attached to. She's never had less to prove, but she's also never had more to lose. And on Beautiful Trauma, she sounds scared shitless by that.</p><p>The first two tracks on the set -- the title track and the Eminem-featuring \"Revenge\" -- feature the freewheeling P!nk we've come to know best this millennium. P!nk doubles down on the volatile romance of her opener with \"Revenge,\" which with its warm organs, sauntering groove, and sweetly sentimental chorus, seems totally at odds with the song's subject of mutually assured betrayal (\"We can do revenge together\"). In the hands of Alecia and Marshall, the double-cheating sounds downright intimate, a healthy outlet for bad relationship vibes that ends with the couple sounding closer than ever for their unfaithfulness. Surprise surprise, Eminem's contribution is especially virulent: He screeches \"SLUT!\" at his female lead and ends his verse threatening \"You're a whore, you're a whore, this is war!\" It's uncomfortable, but part of P!nk's appeal has always been her ability to stay unflinching as she gives as good as she gets, and you can imagine her chuckling to herself during Em's invective, plotting her own return fire.</p><p>But even if she's not scared of her quick-triggered co-star, Beautiful Trauma quickly shows that P!nk is far from totally fearless this days. After the album's opening gambit, the album downshifts with the Max Martin-as-Stargate acoustic shuffle of \"Whatever You Want\" -- in which P!nk dubs her relationship a sinking vessel, but determines to go down with the ship -- and never quite winds up again. The set isn't necessarily draggy: \"Where We Go\" is propelled by a Robin Schulz-like loping guitar melody, while \"Secrets\" even has a touch of deep house to it. But it is unmistakably heavy, especially compared to past P!nk collections; even 2012 predecessor The Truth About Love is sparked by far more pop-punk spunk than you may remember. That sense of levity disappears from Trauma almost completely after its first two cuts, and there's still 11 songs to go.</p><p>The rest of the album is a catalog of P!nk's most profound anxieties, from growing awkwardly into adulthood in \"Barbies\" (\"I turned into someone that I swore I would never be\") to feeling besieged by the state of the world on \"Wild Hearts Can't Be Broken\" (\"There's rage and terror and there's sickness here\"). The biggest worries are saved for her marriage, though, as the majority of the album's songs feature a relationship on the precipice: On \"Whatever You Want\" she declares \"You're the one I wanna sink with,\" but a couple tracks later, she's bemoaning “You hold me close, but I don't feel much… we had a thing, but we lost it,\" then \"I know we fixed it, but it's broken.\" It's not a breakup album, but it definitely fears becoming one: \"Promise me you'll stay tonight, even if it's just for one more night,\" she begs on \"Where We Go\" -- one of several songs with references to mortality, as if her life depends on her love lasting until morning.</p>",
		"lead_image": "http://www.rtodd.net/swift/images/events/music-reviews/beautiful-trauma.jpg",
		"images": [
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/p!nk06.jpg",
				"title": "\"What About Us\" climbed to No. 11 on Radio Songs this week",
				"caption": "Beautiful Trauma quickly shows that P!nk is far from totally fearless this days",
				"credit": "CNN"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/p!nk01.jpg",
				"title": "P!nk",
				"caption": "P!nk's greatness -- four Hot 100 No. 1 hits, 15 top 10 hits, five multi-platinum-certified albums in six tries",
				"credit": "MTV"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/p!nk02.jpg",
				"title": "Her longtime work as a leading music video artist",
				"caption": "She's developed a reputation as one of pop's premier artists",
				"credit": "VH1"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/p!nk03.jpg",
				"title": "She's also been married for over a decade, and now has two kids that she's notably attached to",
				"caption": "She's a legit live draw with has a deep catalog of hits",
				"credit": "Musician Magazine"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/p!nk04.jpg",
				"title": "Eminem's contribution is especially virulent",
				"caption": "P!nk doubles down on the volatile romance of her opener",
				"credit": "Spin Magazine"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/p!nk05.jpg",
				"title": "\"What About Us\" climbed to No. 11 on Radio Songs this week",
				"caption": "Beautiful Trauma quickly shows that P!nk is far from totally fearless this days",
				"credit": "CNN"
			}
		],
		"locations": [
			{
				"latitude": 40.310106,
				"longitude": -75.129894,
				"name": "Doylestown, Pennsylvania"
			}
		],
		"related_content": [
			{
				"headline": "Ben Barnes - British actor and singer",
				"summary": "In September 2006, Barnes was cast as Prince Caspian in The Chronicles of Narnia films Prince Caspian and The Voyage of the Dawn Treader. He has also played Tom Ward in the fantasy film Seventh Son, Dorian Gray in the 2009 adaptation of Oscar Wilde's The Picture of Dorian Gray, had supporting roles in The Words, and The Big Wedding, and portrayed Samuel Adams in the 2015 miniseries Sons of Liberty.",
				"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/ben-barnes.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Ellen Page - Canadian actress",
				"summary": "In 2008, Page was one of 30 celebrities who participated in an online ad series for US Campaign for Burma, calling for an end to the military dictatorship in Burma. She describes herself as a pro-choice feminist.",
				"pub_date": "Fri, 01 Mar 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/ellen-page.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Nico Tortorella - American actor and model",
				"summary": "Speaking to the New York Post's Page Six in June 2016, Tortorella declared himself to be sexually fluid. He later identified as bisexual in an interview with Vulture on October 30, 2016. In November 2017 he talked about being in a polyamorous relationship, a revelation that has gotten him uninvited from his partner's family's Thanksgiving dinner.",
				"pub_date": "Fri, 06 Mar 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/nico-tortorella.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Gillian Anderson - American-British film, television and theatre actress, activist and writer",
				"summary": "Anderson resides with her three children in London, England, where she has lived since 2002. She has been in a relationship with screenwriter and dramatist Peter Morgan since 2016.",
				"pub_date": "Fri, 016 Mar 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/gillian-anderson.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Andy Mientus - American stage and television actor and singer",
				"summary": "On March 9, 2018 Amulet Books, an imprint of ABRAMS, announced that Mientus has written a middle-grade fiction series called The Backstagers",
				"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/andy-mientus.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Jonathan Groff - American actor and singer",
				"summary": "Groff publicly came out as gay in October 2009 during the National Equality March in Washington.[29] From 2009 to 2010, Groff dated actor Gavin Creel.[30] From 2010 to 2013, Groff was in a relationship with actor Zachary Quinto.",
				"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/jonathan-groff.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			}
		]
	},
	{
		"headline": "Neil Young's Paradox – film and soundtrack album review",
		"author": "Michael Bonner",
		"item_class": "music review",
		"guid": "f21f6d26-aaaa-2222-8888-ed4dfe8ebc2c",
		"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
		"summary": "Neil Young is evidently a man on several different missions right now. As a working musician, he is in the throes of a fruitful relationship with Lukas Nelson and the Promise Of The Real. As an archivist, he is teasing out long-lost gems or potent live cuts from his capacious back catalogue. Meanwhile, his environmental activism, a recurring motif since the '70s, has become more pronounced of late",
		"full_text": "<p>Neil Young is evidently a man on several different missions right now. As a working musician, he is in the throes of a fruitful relationship with Lukas Nelson and the Promise Of The Real. As an archivist, he is teasing out long-lost gems or potent live cuts from his capacious back catalogue. Meanwhile, his environmental activism, a recurring motif since the '70s, has become more pronounced of late. A sci-fi novel, we learn, is also in the pipeline. Young's latest project, meanwhile, is Paradox – a Netflix film directed by Daryl Hannah and also a soundtrack album – which goes some way towards uniting all these divergent strands of Young's career. An eco-sci-fi-western, no less, it casts the musician and his young cohorts as cowboys prospecting for 'old' technology – a computer keyboard, an alarm clock, a mobile phone – which they trade every full moon with women in exchange for fresh fruit and vegetables. There are instances of levitation, bad cooking and a vintage steam train. Along the way, Willie Nelson cameos as 'Red', an outlaw who holds up the local Seed Bank with Young's Man In The Black Hat. Naturally, there is also music. The film's centrepiece is a 10-minute instrumental jam taken from \"Cowgirl In The Sand\", filmed at Desert Trip, which helpfully reminds us that however divisive Young's recent output is (Paradox included), the one thing all his fans can at the very least agree on is the awesome power of his live performances.</p><p>Paradox should come as no surprise to veteran Neil watchers. For more than four decades, Young has pursued an idiosyncratic sideline as a filmmaker, using the nom de cinema, Bernard Shakey. His directorial debut, 1974's Journey Through The Past, was a combination of documentary and art-house experiment, and his subsequent productions have been similarly unorthodox affairs. 1982's Human Highway, for instance, was a surreal, apocalyptic satire co-starring Devo, Russ Tamblyn and Dean Stockwell. With its semi-improvised vibe and wild, rambling plotline, Paradox definitely shares that Shakey Pictures spirit. Young's manager, Elliot Roberts, is on hand as a grizzled old cowpoke, offering whacked-out wisdom: \"Always take a look at the food you're about to eat. It's important to know what it is, but it's critical to know what it was.\" You'd imagine, were either man still alive, that this is the kind of role that would have perfectly suited someone like Hopper or Harry Dean Stanton.</p><p>Elsewhere, Young and his band essentially play exaggerated versions of their stage personas. Lukas Nelson is \"Jail Time\", Micah Nelson is \"The Particle Kid\", a kind of steampunk idiot savant. There is talk of \"multi-dimensional turtles\" (perhaps Neil and Daryl are Terry Pratchett fans?) and some Blazing Saddles-style philosophising: \"Love is like a fart. If you've got to force it, it's probably shit.\" There is banter – \"Anarchy rules!\", \"That's an oxymoron!\", \"What did you call me?\" while Young sits in a field for the most part, plucking loose melodies from an acoustic guitar. \"The man in the black hat? They all steer clear of him,\" says one of the gang. \"I heard he can be kind of shaky. Whatever you do don't let him get that stare fixed on you. He's a contrary. Trouble comes in? Best not go and sit down beside it.\"</p><p>Paradox is at best good-natured hijinks; a home movie with some dressing up involved. Shooting on a mix of 16mm and digital, Hannah interspaces the action with nature footage – elk, wolves, deer. She occasionally applies filters, or speeds the film up, contributing to the overall dreamy fantasy. In one sequence, where Young and Promise Of The Real perform \"Peace Trail\" in a revival meeting tent in a field, audience members tether themselves to the ground before being raised heavenward by the music. It is admittedly a fairly clunky metaphor for music as rapture – but feels decidedly tame next to, say, some of the more outré elements of Human Highway (spaceships, Armageddon, Dennis Hopper as a short order cook, and so on). \"Peace Trail\" aside, there are few complete performances in the film. \"Show Me\", from the Peace Trail album, plays over the start. (Incidentally, Peace Trail was one of Young's most enjoyable records of recent years; a lot of that, I think was down to the straightforward arrangements and uncluttered, intuitive playing from Paul Bushnell and Jim Keltner.) Later, we see Young at his pump organ playing \"Pocahontas\" (also filmed at Desert Trip), while the film is closed out by the ukulele version of \"Tumbleweed\" from the Storytone album.</p><p>The film is interspersed with Young's solo score – at times percussive and violent, at others bleakly poetic – that compares to his sublime soundtrack for Jim Jarmusch's Dead Man. The Paradox OST identifies them as \"Paradox Passage\" 1 through to 6. But these pieces are interrupted by other music – some old, some new. Alongside \"Peace Trail\", \"Pocahontas\" and \"Cowgirl Jam\", there's a handful of good instrumentals – including \"Running To The Silver Eagle\", driven by some ferocious interplay between Old Black and a harmonica, and \"Hey\", which sounds like a vague approximation of \"Love And Only Love\". Some, like \"Offerings\", feel little more substantial than light sketches. You'll also find a cover of Willie Nelson's \"Angel Flying Too Close To The Ground\" and loose, acoustic versions of Jimmy Reed's \"Baby What You Want Me To Do?\" and Lead Belly's \"How Long?\" (sung by one of the Nelson brothers) that morphs into The Turtles' \"Happy Together\" before the band collapse into laughter. In many respects, the ramshackle, campfire vibe of the soundtrack mirrors Hannah's film itself – but, critically, it is neither a fully immersive experience like the Dead Man soundtrack or a third album with POTR. It's perhaps best not to view Paradox (either film or soundtrack) as a major work from a significant artist, but yet another of Young's shaggy digressions.</p>",
		"lead_image": "http://www.rtodd.net/swift/images/events/music-reviews/paradox.jpg",
		"images": [
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/neil-young04.jpg",
				"title": "The film is interspersed with Young's solo score",
				"caption": "It's perhaps best not to view Paradox (either film or soundtrack) as a major work from a significant artist, but yet another of Young's shaggy digressions",
				"credit": "Billboard Magazine"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/neil-young01.jpg",
				"title": "Young's latest project, meanwhile, is Paradox",
				"caption": "Neil Young is evidently a man on several different missions right now",
				"credit": "Apple Music"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/neil-young02.jpg",
				"title": "Willie Nelson cameos as 'Red'",
				"caption": "There are instances of levitation, bad cooking and a vintage steam train",
				"credit": "New York Times"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/neil-young03.jpg",
				"title": "The film is interspersed with Young's solo score",
				"caption": "It's perhaps best not to view Paradox (either film or soundtrack) as a major work from a significant artist, but yet another of Young's shaggy digressions",
				"credit": "Billboard Magazine"
			}
		],
		"locations": [
			{
				"latitude": 43.653226,
				"longitude": -79.383184,
				"name": "Toronto, Ontario, Canada"
			}
		],
		"related_content": [
			{
				"headline": "Ben Barnes - British actor and singer",
				"summary": "In September 2006, Barnes was cast as Prince Caspian in The Chronicles of Narnia films Prince Caspian and The Voyage of the Dawn Treader. He has also played Tom Ward in the fantasy film Seventh Son, Dorian Gray in the 2009 adaptation of Oscar Wilde's The Picture of Dorian Gray, had supporting roles in The Words, and The Big Wedding, and portrayed Samuel Adams in the 2015 miniseries Sons of Liberty.",
				"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/ben-barnes.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Ellen Page - Canadian actress",
				"summary": "In 2008, Page was one of 30 celebrities who participated in an online ad series for US Campaign for Burma, calling for an end to the military dictatorship in Burma. She describes herself as a pro-choice feminist.",
				"pub_date": "Fri, 01 Mar 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/ellen-page.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Nico Tortorella - American actor and model",
				"summary": "Speaking to the New York Post's Page Six in June 2016, Tortorella declared himself to be sexually fluid. He later identified as bisexual in an interview with Vulture on October 30, 2016. In November 2017 he talked about being in a polyamorous relationship, a revelation that has gotten him uninvited from his partner's family's Thanksgiving dinner.",
				"pub_date": "Fri, 06 Mar 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/nico-tortorella.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Gillian Anderson - American-British film, television and theatre actress, activist and writer",
				"summary": "Anderson resides with her three children in London, England, where she has lived since 2002. She has been in a relationship with screenwriter and dramatist Peter Morgan since 2016.",
				"pub_date": "Fri, 016 Mar 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/gillian-anderson.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Andy Mientus - American stage and television actor and singer",
				"summary": "On March 9, 2018 Amulet Books, an imprint of ABRAMS, announced that Mientus has written a middle-grade fiction series called The Backstagers",
				"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/andy-mientus.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Jonathan Groff - American actor and singer",
				"summary": "Groff publicly came out as gay in October 2009 during the National Equality March in Washington.[29] From 2009 to 2010, Groff dated actor Gavin Creel.[30] From 2010 to 2013, Groff was in a relationship with actor Zachary Quinto.",
				"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/jonathan-groff.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			}
		]
	},
	{
		"headline": "'Love & Hip Hop Miami' Breakout Star Amara La Negra Lands Multi-Album Record Deal",
		"author": "Marjua Estevez",
		"item_class": "music review",
		"guid": "f21f6d66-aaaa-2222-8888-ed4dfe8ebc2c",
		"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
		"summary": "Amara La Negra is no novice when it comes to music. She's kicked down doors in entertainment for years, breaking stereotypes while singing her black-girl narrative on stages throughout Latin America. From being a child star on Univision's Sábado Gigante to making a name for herself in the urban Latin music industry, Amara's ready for the big time.",
		"full_text": "<p>Amara La Negra is no novice when it comes to music. She's kicked down doors in entertainment for years, breaking stereotypes while singing her black-girl narrative on stages throughout Latin America. From being a child star on Univision's Sábado Gigante to making a name for herself in the urban Latin music industry, Amara's ready for the big time.</p><p>Following the premiere of Love & Hip Hop: Miami and Amara's highly celebrated debut on the reality TV show Monday, Billboard has learned that the Dominican artist has inked a multi-album record deal with Fast Life Entertainment Worldwide and BMG.</p><p>\"I'm still in shock! At times, I am caught pinching myself because there is a part of me that still is in awe of being signed to a franchise that will heighten my success,\" she raved in a statement. \"It is a feeling of a different level of hunger because I have prayed for this so much that it feels unreal! I am humbly honored to have a team that continues to believe in me. Having a pioneer in the music arena like Zach seeing the potential in my musical craft and talent. I am thankful for my team at Fast Life Ent. Worldwide and BMG for this opportunity as an artist. And I cannot for my fans to hear my new music.\"</p><p>Under the new deal -- which was worked out between Fast Life Entertainment Worldwide CEO Jullian Boothe and BMG Recordings President Zach Katz (formerly of indie label Beluga Heights and Dr. Dre's Aftermath Entertainment) -- Amara will release her first single in the first quarter of 2018. Her upcoming music will be produced by hitmakers Rock City, whose previous credits include Rihanna, Beyoncé, Sean Kingston, Miley Cyrus and Nicki Minaj, among many others.</p><p>In a previous interview with Billboard, Amara La Negra expressed her joy and gratitude for gaining a television platform that will help highlight the struggles she's long endured in the music industry as someone who is bicultural and of Afro-Caribbean descent. As she readies fresh music and perhaps a new sound, catch Amara on VH1's Love and Hip Hip: Miami every Monday at 9 p.m. ET.</p>",
		"lead_image": "http://www.rtodd.net/swift/images/events/music-reviews/love-hip-hop-miami.jpg",
		"images": [
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/amara-la-negra04.jpg",
				"title": "She's long endured in the music industry as someone who is bicultural and of Afro-Caribbean descent",
				"caption": "Her upcoming music will be produced by hitmakers Rock City",
				"credit": "Offbeat Magazine"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/amara-la-negra01.jpg",
				"title": "Fast Life Entertainment Worldwide and BMG",
				"caption": "Love & Hip Hop: Miami and Amara's highly celebrated debut",
				"credit": "Creem Magazine"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/amara-la-negra02.jpg",
				"title": "I am humbly honored to have a team that continues to believe in me",
				"caption": "It is a feeling of a different level of hunger because I have prayed for this so much that it feels unreal!",
				"credit": "Apple Music"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/amara-la-negra03.jpg",
				"title": "She's long endured in the music industry as someone who is bicultural and of Afro-Caribbean descent",
				"caption": "Her upcoming music will be produced by hitmakers Rock City",
				"credit": "Offbeat Magazine"
			}
		],
		"locations": [
			{
				"latitude": 25.761680,
				"longitude": -80.19179,
				"name": "Miami"
			}
		],
		"related_content": [
			{
				"headline": "Ben Barnes - British actor and singer",
				"summary": "In September 2006, Barnes was cast as Prince Caspian in The Chronicles of Narnia films Prince Caspian and The Voyage of the Dawn Treader. He has also played Tom Ward in the fantasy film Seventh Son, Dorian Gray in the 2009 adaptation of Oscar Wilde's The Picture of Dorian Gray, had supporting roles in The Words, and The Big Wedding, and portrayed Samuel Adams in the 2015 miniseries Sons of Liberty.",
				"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/ben-barnes.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Ellen Page - Canadian actress",
				"summary": "In 2008, Page was one of 30 celebrities who participated in an online ad series for US Campaign for Burma, calling for an end to the military dictatorship in Burma. She describes herself as a pro-choice feminist.",
				"pub_date": "Fri, 01 Mar 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/ellen-page.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Nico Tortorella - American actor and model",
				"summary": "Speaking to the New York Post's Page Six in June 2016, Tortorella declared himself to be sexually fluid. He later identified as bisexual in an interview with Vulture on October 30, 2016. In November 2017 he talked about being in a polyamorous relationship, a revelation that has gotten him uninvited from his partner's family's Thanksgiving dinner.",
				"pub_date": "Fri, 06 Mar 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/nico-tortorella.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Gillian Anderson - American-British film, television and theatre actress, activist and writer",
				"summary": "Anderson resides with her three children in London, England, where she has lived since 2002. She has been in a relationship with screenwriter and dramatist Peter Morgan since 2016.",
				"pub_date": "Fri, 016 Mar 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/gillian-anderson.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Andy Mientus - American stage and television actor and singer",
				"summary": "On March 9, 2018 Amulet Books, an imprint of ABRAMS, announced that Mientus has written a middle-grade fiction series called The Backstagers",
				"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/andy-mientus.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Jonathan Groff - American actor and singer",
				"summary": "Groff publicly came out as gay in October 2009 during the National Equality March in Washington.[29] From 2009 to 2010, Groff dated actor Gavin Creel.[30] From 2010 to 2013, Groff was in a relationship with actor Zachary Quinto.",
				"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/jonathan-groff.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			}
		]
	},
	{
		"headline": "Review: ‘Death of a Bachelor,' From Panic! at the Disco",
		"author": "Nate Chinen",
		"item_class": "music review",
		"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c",
		"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
		"summary": "The new album by Panic! at the Disco is called \"Death of a Bachelor,\" but its core concern isn't death so much as the afterlife. Brendon Urie, the band's emphatic mind and mouthpiece, wants to know what happens in the wake of a bacchanal, when the wildest urges thrash only in the rear view. \"Welcome to the end of eras,\" he sings on \"Emperor's New Clothes,\" sounding rueful as well as relieved: Farewell to all that, but not without a highlight reel.",
		"full_text": "<p>The new album by Panic! at the Disco is called \"Death of a Bachelor,\" but its core concern isn't death so much as the afterlife. Brendon Urie, the band's emphatic mind and mouthpiece, wants to know what happens in the wake of a bacchanal, when the wildest urges thrash only in the rear view. \"Welcome to the end of eras,\" he sings on \"Emperor's New Clothes,\" sounding rueful as well as relieved: Farewell to all that, but not without a highlight reel.</p><p>If Mr. Urie, 28, sounds like someone adjusting to new circumstances, there may be good reason for that. He's a couple of years into married life, which imbues songs about being lonely while in love, like \"House of Memories,\" with an intriguing frisson.</p><p>Meanwhile, another union in Mr. Urie's life has officially been torn asunder. After a series of personnel shake-ups, his band, formed in 2004 by childhood friends in Las Vegas, recently scaled all the way back to a solo act. (As an amusingly blunt credit in the CD booklet puts it, \"Panic! at the Disco Is: Brendon Urie.\") Not that the album, which was largely produced by Jake Sinclair, sounds any less Day-Glo spectacular than the group's past dispatches.</p><p>Panic! at the Disco has always favored a style both steroidal and slick, and Mr. Urie isn't out to reinvent it here. So if the album's title is meant to evoke \"Death of a Ladies' Man,\" the 1977 album by Leonard Cohen, the analogy never scratches past the surface. A larger touchstone, especially on the title track, is Frank a Sinatra - though Mr. Urie doesn't have the vocal subtlety or the empathy to flesh out his emulation.</p><p>What he does have, now as ever, is panache: He's a firecracker of a frontman, unafraid of strident commitment to a garish conceit. On \"Victorious,\" he evokes both the flamboyant swagger of Queen and the mechanized gleam of Daft Punk. On \"L.A. Devotee,\" he proudly sings of \"drinking white wine in the blushing light.\"</p><p>Mr. Urie has no problem reframing circusesque debauchery, a lyrical trademark, in terms of past indiscretion. It happens on \"Don't Threaten Me With a Good Time,\" which hijacks a twangy guitar riff from the B-52s, and \"Hallelujah,\" which mercifully has nothing to do with Mr. Cohen's best-known song. (Instead, it's a power-pop gloss on a gospel idea.)</p><p>It's in these flickers of conflicted Dionysian feeling that the album has a sense of purpose, beyond what Mr. Urie describes at one point as \"the symphony buzzing in my head.\" To that end, it's fascinating to consider his premise on \"Crazy=Genius,\" a relationship battle royale with a thundering tom-tom beat. \"She said you're just like Mike Love/But you'll never be Brian Wilson,\" he reports, and it's easy to imagine just how much that line would have stung.</p>",
		"lead_image": "http://www.rtodd.net/swift/images/events/music-reviews/death-of-a-bachelor.jpg",
		"images": [
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/panic-at-the-disco06.jpg",
				"title": "Urie possesses a lyric tenor vocal range that spans four octaves",
				"caption": "Urie described himself as a \"spaz in high school\"",
				"credit": "The Wire Magazine"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/panic-at-the-disco01.jpg",
				"title": "Panic! at the Disco",
				"caption": "Panic! at the Disco is an American rock band from Las Vegas, Nevada",
				"credit": "Offbeat Magazine"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/panic-at-the-disco02.jpg",
				"title": "Urie has said that he has been diagnosed with ADHD",
				"caption": "Influenced by 1960s rock bands the Beatles, the Zombies and the Beach Boys",
				"credit": "Rock & Folk Magazine"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/panic-at-the-disco03.jpg",
				"title": "On April 11, 2017, Urie announced that he would star in Cyndi Lauper's Tony Award-winning Broadway musical, Kinky Boots",
				"caption": "The band's sixth studio album, Pray for the Wicked, is set to be released on June 22, 2018.",
				"credit": "Music America Magazine"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/panic-at-the-disco04.jpg",
				"title": "Brendon co-wrote a song with Rivers Cuomo of the band Weezer",
				"caption": "Urie was raised in a Mormon family, but left the faith around 17",
				"credit": "Billboard Magazine"
			},
			{
				"path": "http://www.rtodd.net/swift/images/events/music-reviews/panic-at-the-disco05.jpg",
				"title": "Urie possesses a lyric tenor vocal range that spans four octaves",
				"caption": "Urie described himself as a \"spaz in high school\"",
				"credit": "The Wire Magazine"
			}
		],
		"locations": [
			{
				"latitude": 37.096528,
				"longitude": -113.568416,
				"name": "St. George, UT"
			}
		],
		"related_content": [
			{
				"headline": "Ben Barnes - British actor and singer",
				"summary": "In September 2006, Barnes was cast as Prince Caspian in The Chronicles of Narnia films Prince Caspian and The Voyage of the Dawn Treader. He has also played Tom Ward in the fantasy film Seventh Son, Dorian Gray in the 2009 adaptation of Oscar Wilde's The Picture of Dorian Gray, had supporting roles in The Words, and The Big Wedding, and portrayed Samuel Adams in the 2015 miniseries Sons of Liberty.",
				"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/ben-barnes.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Ellen Page - Canadian actress",
				"summary": "In 2008, Page was one of 30 celebrities who participated in an online ad series for US Campaign for Burma, calling for an end to the military dictatorship in Burma. She describes herself as a pro-choice feminist.",
				"pub_date": "Fri, 01 Mar 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/ellen-page.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Nico Tortorella - American actor and model",
				"summary": "Speaking to the New York Post's Page Six in June 2016, Tortorella declared himself to be sexually fluid. He later identified as bisexual in an interview with Vulture on October 30, 2016. In November 2017 he talked about being in a polyamorous relationship, a revelation that has gotten him uninvited from his partner's family's Thanksgiving dinner.",
				"pub_date": "Fri, 06 Mar 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/nico-tortorella.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Gillian Anderson - American-British film, television and theatre actress, activist and writer",
				"summary": "Anderson resides with her three children in London, England, where she has lived since 2002. She has been in a relationship with screenwriter and dramatist Peter Morgan since 2016.",
				"pub_date": "Fri, 016 Mar 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/gillian-anderson.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Andy Mientus - American stage and television actor and singer",
				"summary": "On March 9, 2018 Amulet Books, an imprint of ABRAMS, announced that Mientus has written a middle-grade fiction series called The Backstagers",
				"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/andy-mientus.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Jonathan Groff - American actor and singer",
				"summary": "Groff publicly came out as gay in October 2009 during the National Equality March in Washington.[29] From 2009 to 2010, Groff dated actor Gavin Creel.[30] From 2010 to 2013, Groff was in a relationship with actor Zachary Quinto.",
				"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/jonathan-groff.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			}
		]
	}
]