{
	"version": "1.0",
	"title": "Music",
	"items": [
		{
			"headline": "2112 - Rush",
			"subhead": "",
			"creator": {
				"name": "Stephanie Staff Memeber - Staff",
				"title": "Staff",
				"image": "",
				"social": [
					{
						"network": "facebook",
						"user": ""
					},
					{
						"network": "twitter",
						"user": ""
					},
					{
						"network": "instagram",
						"user": ""
					}
				]
			},
			"item_class": "music review",
			"category": {
				"title": "Rock",
				"background_color": "#003264",
				"text_color": "#fff"
			},
			"guid": "f21f6d26-aaaa-1111-8401-ed4dfe8ebc2c",
			"pub_date": "Tue, 26 Jun 2018 09:25:00 EDT",
			"summary": "2112 is the fourth studio album by Canadian rock band Rush, released on April 1, 1976 by Anthem Records. After they finished touring their previous album, Caress of Steel, in early 1976, the band were in financial hardship due to the album's disappointing sales, unfavourable critical reception, and a decline in numbers at their shows.",
			"full_text": "<p>2112 is the fourth studio album by Canadian rock band Rush, released on April 1, 1976 by Anthem Records. After they finished touring their previous album, Caress of Steel, in early 1976, the band were in financial hardship due to the album's disappointing sales, unfavourable critical reception, and a decline in numbers at their shows.<h3>Background</h3><p>In January 1976, Rush ended their 1975-1976 tour to support their third studio album, Caress of Steel. They had enjoyed writing and recording the album yet Lifeson recalled the group in a state of confusion after the tour, sensing the disappointing reaction from crowds after playing it on stage. The progressive rock-themed album with lengthy, story-based songs, complex song structures, and hard to grasp lyrics, made it difficult to receive radio airplay and promote effectively. Lee said the band could not understand the underwhelming response, and later dubbed the tour the \"Down the Tubes Tour\" as they struggled to meet their $125 a week salary, and their crowds had declined. Lee added, \"That really shakes your confidence. We were so confused and disheartened\". In 1980, Lifeson picked this moment of the band's history as the only time he felt close to giving up.<p>To make matters worse, Caress of Steel raised concerns for management at Mercury Records, their international label, who considered dropping them. Rush manager Ray Danniels then flew to their head offices in Chicago to regain their confidence, and spoke highly of the band's new ideas for a new album without hearing any of it. Mercury complied, and gave the green-light to one more album. Despite the pressure from the label and management to make a more commercial record, the band ignored the advice and proceeded with material as they saw fit. Lifeson questioned the musical direction the band were to take at such a crucial time in the band's history. \"I remember having these conversations about, 'What are we going to do? Are we going to try to make another mini-Led Zeppelin record or are we going to do what we are going to do and continue forward and whatever happens, happens?' That's what we honestly decided to do. We fully intended to go down in flames but we were prepared to do that\".</p><h3>Side one</h3><p>Side one of the album is occupied by the 20-minute futuristic science fiction song \"2112\". The seven-part track is based on a story by Peart, the band's primary lyricist, who credits \"the genius of Ayn Rand\" in the album's liner notes. Rand, a Russian-born, Jewish-American novelist and inventor of the philosophy of Objectivism, wrote the 1937 dystopian fictional novella Anthem, the plot of which bears several similarities to 2112, and all members read the book. Peart added the credit to avoid any legal action. The credit caused the band significant negative publicity, with some even labelling them right-wing extremists. In the British paper NME, Barry Miles made allusions to Nazism, which particularly offended Lee, whose parents were Holocaust survivors. The first and last sections, \"Overture\" and \"Grand Finale\", respectively, are instrumental and borrows a short sequence from 1812 Overture by Pyotr Tchaikovsky. The \"Overture\" features an introduction from graphic designer and musician Hugh Syme performed on a ARP Odyssey synthesizer with an Echoplex Delay pedal. Music writer and professor Rob Bowman calculated that in the entire piece, 2:34 of the song contains improvised guitar solos. \"Overture\" contains the lyric \"And the meek shall inherit the earth\", a reference to the Biblical passages Book of Psalms 37:11 and Matthew 5:5.</p><p>\"2112\" tells a story set in the city of Megadon in the year 2112, \"where individualism and creativity are outlawed with the population controlled by a cabal of malevolent Priests who reside in the Temples of Syrinx\". A galaxy-wide war resulted in the planets forcefully joining the Solar Federation (symbolized by the \"Red Star\"). By 2112, the world is controlled by the priests who take orders from giant banks of computers inside the temple. Music is unknown in the world absent of creativity and individuality, but in \"Discovery\", a nameless man finds a beaten guitar inside a cave and rediscovers the lost art of music. In \"Presentation\", the man brings the guitar to the priests at the temple, who say, \"yes, we know, it's nothing new; it's just a waste of time,\" and then proceed angrily to destroy it and banish him. Next, in \"Oracle: The Dream\", the man dreams of a new planet, established at the same time of the Solar Federation, where creative people live. He awakens, depressed that music is part of such a civilization and that he can never be part of it, and commits suicide, in \"Soliloquy\", originally titled \"Soliloquy of the Soul\". Another planetary war begins in \"Grand Finale\", originally named \"Denouement\", resulting in the ambiguous spoken ending: \"Attention all planets of the Solar Federation: We have assumed control\". Peart described the ending as a \"double surprise ... a real Hitchcock killer\".</p><h3>Side two</h3><p>Side two contains five individual songs that display the band's more traditional hard rock sound and Lee's higher pitched vocals that was adopted on their previous albums. Lifeson said having a title track more serious, the rest of the album was to be \"just a little lighter and a little more fun\". Bowman wrote the variation of styles on side two offers \"a very different listening experience\" in comparison. Though the tracks are not specifically about the \"2112\" concept, they do contain ideas that can relate to its overall theme. Lee wrote the lyrics for \"Tears\" and Lifeson wrote the words on \"Lessons\", while Peart wrote the rest.</p><p>\"A Passage to Bangkok\" is a song about marijuana; Lee said it is \"a travelogue for all the places in the world that grow the best weed\". The track mentions a number of cities and countries, including Bogotá, Acapulco, Morocco, Bangkok and Kathmandu, Nepal. Rush started to write \"The Twilight Zone\" at a time when they needed one more song to fill both sides of the vinyl record. The band were big fans of the television series The Twilight Zone, and based the track on the stories written for it from its host, Rod Serling. \"Lessons\" is one of the few Rush songs written solely by Lifeson. For him, the process of songwriting is more seldom and spontaneous in comparison to dedicating time to write, rehearse, and scrap parts that do not work. \"Tears\" is a romantic ballad and is the first Rush track to incorporate the Mellotron, which Syme performs. \"Something for Nothing\" is a song about freewill and decision making. Regarding this song, Peart states: \"All those paeans to American restlessness and the American road carried a tinge of wistfulness, an acknowledgement of the hardships of the vagrant life, the notion that wanderlust could be involuntary, exile as much as freedom, and indeed, the understanding that freedom wasn't free. In the mid-1970s, the band was driving to a show in downtown Los Angeles, at the Shrine Auditorium, and I noticed some graffiti splattered across a wall: 'Freedom isn't free,' and I adapted that for a song on 2112.\"</p>",
			"lead_media": {
					"type": "image",
					"path": "http://www.rtodd.net/swift/images/reviews-music/2112.jpg",
					"title": "2112 - Rush",
					"caption": "2112 is the fourth studio album by Canadian rock band Rush, released on April 1, 1976 by Anthem Records. After they finished touring their previous album, Caress of Steel, in early 1976, the band were in financial hardship due to the album's disappointing sales, unfavourable critical reception, and a decline in numbers at their shows.",
					"credit": "Rolling Stone"
			},
			"media": [
				{
					"path": "http://www.rtodd.net/swift/images/reviews-music/2112.jpg",
					"title": "2112 - Rush",
					"caption": "2112 is the fourth studio album by Canadian rock band Rush, released on April 1, 1976 by Anthem Records. After they finished touring their previous album, Caress of Steel, in early 1976, the band were in financial hardship due to the album's disappointing sales, unfavourable critical reception, and a decline in numbers at their shows.",
					"credit": "Rolling Stone"
				}
			],
			"locations": [
				{
					"latitude": 43.771171,
					"longitude": -79.41975,
					"name": "Willowdale, Toronto, Ontario, Canada"
				}
			],
			"related_content": {
				"title": "More Albums",
				"items": [
					{
						"headline": "2112 - Rush",
						"summary": "2112 is the fourth studio album by Canadian rock band Rush, released on April 1, 1976 by Anthem Records. After they finished touring their previous album, Caress of Steel, in early 1976, the band were in financial hardship due to the album's disappointing sales, unfavourable critical reception, and a decline in numbers at their shows.",
						"guid": "http://www.rtodd.net/swift/data/related/rush.json",
						"pub_date": "Wed, 09 May 2018 09:25:00 EDT",
						"lead_media": {
							"type": "image",
							"path": "http://www.rtodd.net/swift/images/reviews-music/2112.jpg",
							"title": "2112 - Rush",
							"caption": "2112 is the fourth studio album by Canadian rock band Rush, released on April 1, 1976 by Anthem Records. After they finished touring their previous album, Caress of Steel, in early 1976, the band were in financial hardship due to the album's disappointing sales, unfavourable critical reception, and a decline in numbers at their shows.",
							"credit": "Rolling Stone"
						}
					},
					{
						"headline": "Dead Man's Party - Oingo Boingo",
						"summary": "Dead Man's Party is the fifth album by American new wave band Oingo Boingo, released in 1985. The album cover art is an homage to the Mexican holiday Día de Muertos.",
						"guid": "http://www.rtodd.net/swift/data/related/oingo-boingo.json",
						"pub_date": "Wed, 09 May 2018 09:25:00 EDT",
						"lead_media": {
							"type": "image",
							"path": "http://www.rtodd.net/swift/images/reviews-music/deadmansparty.jpg",
							"title": "Dead Man's Party - Oingo Boingo",
							"caption": "Dead Man's Party is the fifth album by American new wave band Oingo Boingo, released in 1985. The album cover art is an homage to the Mexican holiday Día de Muertos.",
							"credit": "Rolling Stone"
						}
					},
					{
						"headline": "Duran Duran",
						"summary": "Duran Duran are an English new wave and synthpop band formed in Birmingham in 1978. The band grew from alternative sensations in 1982 to mainstream pop stars by 1984. By the end of the decade, membership and music style changes challenged the band before a resurgence in the early 1990s.",
						"guid": "http://www.rtodd.net/swift/data/related/duran-duran.json",
						"pub_date": "Wed, 09 May 2018 09:25:00 EDT",
						"lead_media": {
							"type": "image",
							"path": "http://www.rtodd.net/swift/images/reviews-music/duranduran.jpg",
							"title": "Duran Duran",
							"caption": "Duran Duran are an English new wave and synthpop band formed in Birmingham in 1978. The band grew from alternative sensations in 1982 to mainstream pop stars by 1984. By the end of the decade, membership and music style changes challenged the band before a resurgence in the early 1990s.",
							"credit": "Rolling Stone"
						}
					},
					{
						"headline": "Wham!",
						"summary": "Wham! were an English musical duo formed by members George Michael and Andrew Ridgeley in 1981. They were briefly known in the United States as Wham! UK due to a naming conflict with an American band. Wham! sold more than 30 million certified records worldwide from 1982 to 1986.",
						"guid": "http://www.rtodd.net/swift/data/related/wham.json",
						"pub_date": "Wed, 09 May 2018 09:25:00 EDT",
						"lead_media": {
							"type": "image",
							"path": "http://www.rtodd.net/swift/images/reviews-music/wham.jpg",
							"title": "Wham!",
							"caption": "Wham! were an English musical duo formed by members George Michael and Andrew Ridgeley in 1981. They were briefly known in the United States as Wham! UK due to a naming conflict with an American band. Wham! sold more than 30 million certified records worldwide from 1982 to 1986.",
							"credit": "Rolling Stone"
						}
					}
				]
			}
		}
	]
}